In [1]:

import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import scipy.stats as st
from pathlib import Path

In [12]:
# Read the file from the Resources Folder
ds_salaries_1 = pd.read_csv("Resources/ds_salaries-1.csv")
ds_salaries_2 = pd.read_csv("Resources/ds_salaries-2.csv")

ds_combined_salaries= pd.concat([ds_salaries_1,ds_salaries_2])

# Drop any index column from the combined csv file
ds_combined_salaries = ds_combined_salaries.drop(columns=['Unnamed: 0'])
ds_combined_salaries.count()

work_year             4362
experience_level      4362
employment_type       4362
job_title             4362
salary                4362
salary_currency       4362
salary_in_usd         4362
employee_residence    4362
remote_ratio          4362
company_location      4362
company_size          4362
dtype: int64

In [15]:
us_ds_salaries = ds_combined_salaries.groupby('company_location')
us_ds_salaries.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
480,2022,SE,FT,Machine Learning Engineer,120000,USD,120000,AE,100,AE,S
487,2022,EN,PT,Data Scientist,100000,USD,100000,DZ,50,DZ,M
489,2022,EN,CT,Applied Machine Learning Scientist,29000,EUR,31875,TN,100,CZ,M
501,2022,MI,FT,Head of Data,30000,EUR,32974,EE,100,EE,S
502,2022,EN,FT,Data Scientist,40000,USD,40000,JP,100,MY,L

In [ ]:
# Compairison to the US Avg. Salary by year
# Bar graph

In [ ]:
# Average salary per work schedule
# Bar Graph

In [ ]:
# Company who is paying more
# Bar graph

In [ ]:
# Work exp compairison
# Bar and line

In [ ]:
# Compairing salary stats over the years